Revit 2026 API

# MacroModuleGetMacro Method

---

Gets the macro with the give name.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Macro GetMacro(
	string name
)
```
```vb
Public Function GetMacro (
	name As String
) As Macro
```
```cpp
public:
Macro^ GetMacro(
	String^ name
)
```
```fsharp
member GetMacro :
        name : string -> Macro
```

#### Parameters

name String
     The macro name.

#### Return Value

Macro The macro.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

MacroModule Class

Autodesk.Revit.DB.Macros Namespace